huming2207/esp_swd_demo/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.1.0 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s31"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SWD_PHY_AXC2T245=y
CONFIG_ESP_SWD_CLK_PIN=10
CONFIG_ESP_SWD_DATA_OUT_PIN=16
CONFIG_ESP_SWD_DATA_IN_PIN=15
CONFIG_ESP_SWD_DATA_NOE_PIN=12
CONFIG_ESP_SWD_DATA_DIR1_PIN=14
CONFIG_ESP_SWD_DATA_DIR2_PIN=13
CONFIG_ESP_SWD_CLK_NOE_PIN=8
CONFIG_ESP_SWD_NRST_PIN=11
CONFIG_ESP_SWD_BOOT_PIN=9
CONFIG_ESP_SWD_DEFAULT_CLOCK_HZ=13000000
CONFIG_ESP_SWD_FAST_DELAY_NOPS=0
CONFIG_ESP_SWD_TURNAROUND_DELAY_US=0
CONFIG_ESP_SWD_TURNAROUND_DELAY_NS=1
CONFIG_ESP_SWD_DEDICATED_TRANSLATOR_CONTROLS=y
CONFIG_ESP_SWD_USE_SPI=y
CONFIG_ESP_SWD_PERF_INSTRUMENTATION=y
